Revit 2023 API
RebarContainerItem.TopFinishingTurns Property
 For a spiral, the number of finishing turns at the upper end of the spiral.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2016
Syntax
C#
public int TopFinishingTurns { get; set; }
Visual Basic
Public Property TopFinishingTurns As Integer
	Get
	Set
Visual C++
public:
property int TopFinishingTurns {
	int get ();
	void set (int value);
}
Remarks
 Applies only to instances where RebarShape.Definition is of type RebarShapeDefinitionByArc, and its Type property is equal to the value RebarShapeDefinitionByArcType.Spiral.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: turns must be between 0 and 100.
Autodesk.Revit.Exceptions.DisabledDisciplineException |  When setting this property: None of the following disciplines is enabled: Structural.
Autodesk.Revit.Exceptions.InvalidOperationException |  This RebarContainerItem is not an instance of a spiral shape.
See Also
RebarContainerItem Class
Autodesk.Revit.DB.Structure Namespace